cf_billing/Reports/энргСводнаяИнформацияОКоличествеЛицевыхСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>энргСводнаяИнформацияОКоличествеЛицевыхСчетов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоРасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРасчетногоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

cf_billing/Reports/энргСводнаяИнформацияОКоличествеЛицевыхСчетов/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	УстановитьПараметрыСКД();
КонецПроцедуры

&НаКлиенте
Процедура РайонПриИзменении(Элемент)
	УстановитьПараметрыСКД();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСКД()
	
	КомпоновщикНастроек = ЭтаФорма.Отчет.КомпоновщикНастроек;
	
	ПараметрПериодОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета"); 
	ПараметрПериодОтчета.Использование = Истина; 
	ПараметрПериодОтчета.Значение  = Отчет.ПериодОтчета; 
	
		
	ПараметрРайон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Район");
	ПараметрРайон.Использование = Истина;
	ПараметрРайон.Значение  = Район;
	
	ПериодНачисления = Обработки.энргГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(Отчет.ПериодОтчета, Район.Организация,Район);
	ГраницаОП = Обработки.энргГраницыПериодаНачисленияМенеджер.ГраницыРасчетногоПериода(Район.Организация,Район, ПериодНачисления,Ложь);
	НачалоРасчетногоПериода = ГраницаОП.НачалоОП;
	КонецРасчетногоПериода = ГраницаОП.ЗавершениеОП - 1;
	
	
	ПараметрДатаНач = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоРасчетногоПериода");
	ПараметрДатаНач.Использование = Истина;
	ПараметрДатаНач.Значение  = НачалоРасчетногоПериода;
	
	ПараметрДатаКон = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецРасчетногоПериода");
	ПараметрДатаКон.Использование = Истина;
	ПараметрДатаКон.Значение  = КонецРасчетногоПериода;
	
КонецПроцедуры

#КонецОбласти
